randread/150_node/job_1471007_fiojob_8/nid00104_fiojob_8/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 8 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=8): err= 0: pid=186226: Tue Jul 20 11:23:18 2021
  read: IOPS=576, BW=2307KiB/s (2362kB/s)(676MiB/300014msec)
    slat (usec): min=488, max=184265, avg=13848.68, stdev=11379.40
    clat (usec): min=15, max=4541.7k, avg=3520791.92, stdev=320111.55
     lat (msec): min=10, max=4556, avg=3534.64, stdev=320.55
    clat percentiles (msec):
     |  1.00th=[ 2937],  5.00th=[ 3171], 10.00th=[ 3239], 20.00th=[ 3339],
     | 30.00th=[ 3406], 40.00th=[ 3473], 50.00th=[ 3507], 60.00th=[ 3574],
     | 70.00th=[ 3641], 80.00th=[ 3742], 90.00th=[ 3842], 95.00th=[ 3977],
     | 99.00th=[ 4212], 99.50th=[ 4279], 99.90th=[ 4396], 99.95th=[ 4463],
     | 99.99th=[ 4530]
   bw (  KiB/s): min= 1072, max= 3320, per=99.83%, avg=2303.19, stdev=39.86, samples=4746
   iops        : min=  268, max=  830, avg=575.80, stdev= 9.97, samples=4746
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.06%, 500=0.08%
  lat (msec)   : 750=0.08%, 1000=0.08%, 2000=0.32%, >=2000=99.36%
  cpu          : usr=0.18%, sys=1.20%, ctx=173087, majf=0, minf=2359
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=173020,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=2307KiB/s (2362kB/s), 2307KiB/s-2307KiB/s (2362kB/s-2362kB/s), io=676MiB (709MB), run=300014-300014msec